tap "achannarasappa/tap"
tap "charmbracelet/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern replacement for 'ls'
brew "exa"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool for glamorous shell scripts
brew "gum"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LastPass command-line interface tool
brew "lastpass-cli"
# Music engraving system
brew "lilypond"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Software environment for statistical computing
brew "r"
# Sparklines for the shell
brew "spark"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The Charm Tool and Library 🌟
brew "charmbracelet/tap/charm"
# A tool for recording terminal GIFs
brew "charmbracelet/tap/vhs"
# Free video downloader
cask "4k-video-downloader"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Password manager
cask "lastpass"
# App to write, plan, collaborate, and get organized
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "Highland 2", id: 1171820258
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Mini Metro+", id: 1550663539
mas "Mini Motorways", id: 1456188526
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Screencast", id: 1368905598
mas "Spark", id: 1176895641
mas "SystemPal", id: 453164367
mas "Todoist", id: 585829637
mas "XMenu", id: 419332741
